[
  {
    "repo": "IpShared",
    "link": "https://github.com/Tiago-Daniel-Guerreiro/IpShared",
    "description": "Uma ferramenta multiplataforma para converter endereços IP em formatos fáceis de partilhar.",
    "title": "IpShared (Partilha de Endereços IP)",
    "description_html": "<p>Este projeto nasceu de uma necessidade que antecipei para um projeto futuro maior. Decidi criar o IpShared como uma ferramenta independente para resolver o problema de partilhar endereços IP e, ao mesmo tempo, aproveitar a oportunidade para explorar o desenvolvimento multiplataforma com <strong>C#</strong> e <strong>Avalonia UI</strong>.</p>\n<p>A aplicação converte um par IP/Porta em formatos \"humanos\" (como uma sequência de palavras) ou compactos, simplificando a sua partilha e reduzindo erros na partilha.</p>\n<h2>🚀 Tecnologias Utilizadas</h2>\n<ul>\n<li><strong>Linguagem:</strong> C#</li>\n<li><strong>Framework de UI:</strong> Avalonia UI (para suporte nativo a Windows, Android, e potencialmente Linux)</li>\n<li><strong>Controle de Versões:</strong> Git e GitHub</li>\n<li><strong>Extra:</strong> A base da UI foi gerada experimentalmente com <strong>Inteligência Artificial</strong>, servindo como um estudo de caso sobre as suas capacidades e limitações atuais no desenvolvimento de interfaces.</li>\n</ul>\n<h2>🎯 Objetivo Principal</h2>\n<p>Este projeto foi guiado por alguns objetivos claros:</p>\n<ul>\n<li><strong>Criar uma Ferramenta Útil:</strong> O objetivo principal foi construir uma aplicação funcional e autónoma que resolvesse um problema real e que pudesse ser usada para apoiar outros projetos.-  <strong>Exploração Tecnológica:</strong> O projeto foi um campo de testes para aprender os fundamentos do Avalonia UI, do desenvolvimento multiplataforma e para aprofundar conhecimentos em <strong>manipulação de bits e algoritmos de codificação</strong>.</li>\n<li><strong>Validação do Algoritmo:</strong> A aplicação serviu como um ambiente real para implementar e testar o algoritmo de conversão de dados, que é o núcleo da ferramenta.</li>\n</ul>\n<h2>✔️ A Solução</h2>\n<p>IpShared oferece uma interface simples para converter um par IP/Porta em vários formatos otimizados para partilha, cada um com um propósito específico:</p>\n<ul>\n<li><strong>Formato Words (Human-Readable):</strong> O principal diferencial. Transforma os dados numa sequência de 5 palavras fáceis de ditar. Utilizando a <strong>capitalização das letras para codificar metadados</strong> como o ID do idioma e parte da porta, sem adicionar caracteres extras.</li>\n<li><strong>Formato Base16/Base62:</strong> Gera códigos alfanuméricos curtos, ideais para copiar e colar em chats ou documentos.</li>\n<li><strong>Código QR:</strong> Apresenta um QR Code com os dados codificados, perfeito para partilha visual e rápida com dispositivos móveis.</li>\n<li><strong>Default:</strong> O formato clássico <code>IP:Porta</code> para referência.</li>\n</ul>\n<p>A lógica de conversão está isolada da UI. A secção abaixo detalha a arquitetura técnica do formato \"Words\".</p>\n<h2>⚙️ Como Funciona: A Codificação do Formato \"Words\"</h2>\n<p>O verdadeiro desafio técnico do IpShared foi criar um algoritmo capaz de empacotar de forma reversível 52 bits de dados (32 do IP, 16 da Porta e 4 do ID do Idioma) numa sequência de 5 palavras. Isto foi alcançado através de uma combinação de interleaving e codificação de metadados via capitalização:</p>\n<ul>\n<li><strong>Codificação do ID do Idioma (4 bits):</strong> Os 4 bits que identificam a lista de palavras (permitindo até 16 idiomas) são codificados de forma subtil na <strong>capitalização da primeira letra das primeiras quatro palavras</strong>. Um <code>1</code> torna a letra maiúscula; um <code>0</code> mantém-na minúscula.</li>\n<li><strong>Codificação dos Metadados da Porta (3 bits):</strong> Parte da informação da porta (os 3 bits menos significativos) é codificada na <strong>capitalização das letras da última palavra</strong>. Um padrão de maiúsculas/minúsculas (ex: <code>PoTe</code>) representa diretamente esses bits, permitindo reconstruir parte da porta sem usar espaço extra.</li>\n<li><strong>Empacotamento dos Dados Restantes:</strong> Os dados restantes – 32 bits do IP e 13 bits da porta – são combinados e divididos em \"chunks\" de 9 bits.</li>\n<li><strong>Mapeamento para Palavras:</strong> Cada \"chunk\" de 9 bits corresponde a um índice num dicionário de 512 palavras (<code>2^9</code>), resultando na sequência final de 5 palavras.</li>\n</ul>\n<p>Esta abordagem introduz uma <strong>dificuldade conhecida</strong>: a partilha verbal pode tornar-se mais complexa, especialmente ao ditar o padrão de capitalização da última palavra. No entanto, foi uma decisão de design deliberada. As alternativas seriam adicionar uma sexta palavra (comprometendo a brevidade) ou limitar significativamente o intervalo de portas suportado. Optei por esta solução por considerar que a dificuldade de verbalização ocorre apenas em casos específicos, enquanto os benefícios de manter uma string de 5 palavras e suportar toda a gama de portas são permanentes.</p>\n<h2>👤 Meu Papel</h2>\n<p>Neste projeto, o meu papel foi o de antecipar uma necessidade que teria em um projeto futuro. Em vez de esperar que a partilha de IPs se tornasse um problema, decidi construir uma solução antes do tempo, criando esta ferramenta.</p>\n<p>Fui responsável por todo o processo: desde a <strong>identificação da necessidade</strong> e o <strong>design da solução</strong>, até à <strong>implementação do algoritmo de codificação de dados</strong> e ao <strong>desenvolvimento da UI</strong> que constitui a própria ferramenta. Este projeto mostra a minha forma de trabalhar: construir não só as aplicações, mas também as ferramentas que as suportam.</p>\n<h2>⚙️ Principais Desafios</h2>\n<ul>\n<li><strong>Curva de Aprendizagem do Avalonia UI:</strong> Embora semelhante a outros frameworks XAML, o Avalonia tem particularidades na configuração de projetos multiplataforma e na gestão de layouts responsivos.</li>\n<li><strong>Trabalhar com UI Gerada por IA:</strong> A interface gerada automaticamente, embora um bom ponto de partida, continha bugs de layout e código não idiomático, exigindo uma refatoração significativa para se tornar funcional.</li>\n<li><strong>Empacotamento de Dados em Bits:</strong> O maior desafio técnico foi criar um algoritmo reversível para empacotar eficientemente não apenas um endereço IP (32 bits), mas também um número de <strong>porta (16 bits)</strong> e um <strong>identificador de idioma (4 bits)</strong> – permitindo até 16 listas de palavras diferentes. Isto exigiu manipulação cuidadosa de bits para garantir que todos os dados fossem codificados e descodificados corretamente dentro do formato \"Words\".</li>\n</ul>\n<h2>✅ Resultados</h2>\n<ul>\n<li><strong>Protótipo Funcional:</strong> A aplicação está totalmente funcional em Windows e Android, validando a viabilidade da ideia e da tecnologia escolhida.</li>\n<li><strong>Aprendizagem Acelerada:</strong> O projeto foi uma excelente plataforma para aprender na prática os conceitos do Avalonia UI, do desenvolvimento multiplataforma em .NET e para aprofundar conhecimentos em <strong>algoritmos de codificação e manipulação de bits a baixo nível</strong>.</li>\n<li><strong>Visão Realista sobre IA em UI:</strong> A experiência proporcionou uma visão clara das capacidades e (atuais) limitações da IA na geração de interfaces, mostrando que a supervisão e intervenção de um desenvolvedor ainda são essenciais.</li>\n</ul>\n<h2>🔮 Próximos Passos</h2>\n<p>O projeto está em fase inicial e tem um plano claro para o futuro:</p>\n<ul>\n<li><strong>Melhorar a Experiência de Utilizador em Android:</strong> A lógica atual de copiar e selecionar texto foi herdada da versão de desktop. É crucial refatorar esta parte para implementar uma experiência mais nativa para mobile, como um botão \"tocar para copiar\", que é mais intuitivo do que a seleção de texto manual em ecrãs táteis.</li>\n<li><strong>Refatoração Completa da UI:</strong> Substituir o código gerado por IA por uma interface mais limpa, idiomática e robusta.</li>\n<li><strong>Adicionar Suporte a Novas Plataformas:</strong> Compilar e testar a aplicação para garantir a compatibilidade com <strong>Linux</strong>.</li>\n<li><strong>Melhorias de Usabilidade:</strong> Adicionar mais opções de conversão e configurações personalizáveis.</li>\n</ul>"
  },
  {
    "repo": "AppDeQuiosque",
    "link": "https://github.com/Tiago-Daniel-Guerreiro/AppDeQuiosque",
    "description": "Aplicação de Quiosque interativo em C# desenvolvido profissionalmente.",
    "title": "Aplicação de Quiosque",
    "description_html": "<p>Esta é uma aplicação de quiosque interativo desenvolvida como projeto final da Formação em Contexto de Trabalho (FCT) na NOVA School of Law. O seu principal objetivo é fornecer um ponto de suporte autónomo para alunos, professores e funcionários, reduzindo a carga de trabalho da equipa de TI ao responder a perguntas frequentes.</p>\n<p>O grande diferencial do projeto é a sua arquitetura <strong>flexível e configurável</strong>, permitindo que toda a aparência, layout e funcionalidades da aplicação sejam geridas dinamicamente através de ficheiros JSON, sem necessidade de qualquer alteração no código-fonte.</p>\n<h2>🚀 Tecnologias Utilizadas</h2>\n<ul>\n<li><strong>Linguagem e Framework:</strong> C# e Windows Forms (.NET Framework)</li>\n<li><strong>IDE:</strong> Visual Studio 2019</li>\n<li><strong>Formato de Configuração:</strong> Ficheiros JSON</li>\n<li><strong>Controlo de Versões:</strong> Git e GitHub</li>\n</ul>\n<h2>🎯 Objetivo Principal</h2>\n<p>O objetivo era desenvolver uma aplicação de suporte que pudesse ser facilmente gerida pela equipa de TI da instituição, sem depender de um programador para fazer alterações. Os objetivos-chave foram:</p>\n<ul>\n<li><strong>Flexibilidade Máxima:</strong> Criar um menu cujos botões, textos, ações e layout fossem totalmente definidos por um ficheiro de configuração externo.</li>\n<li><strong>Autonomia para o Gestor:</strong> Permitir que a equipa de TI pudesse adicionar, remover ou modificar conteúdos (links, PDFs, guias passo a passo) através de uma interface de configurações gráfica e intuitiva.</li>\n<li><strong>Personalização Visual:</strong> Permitir a criação de múltiplos perfis e temas visuais (cores, fontes, transparência, imagens de fundo) para adaptar a aplicação a diferentes contextos ou necessidades de branding.</li>\n</ul>\n<h2>❓ O Problema</h2>\n<p>A Divisão de Informática e Comunicações de uma instituição de ensino recebe um volume elevado de pedidos de suporte repetitivos, como configuração de redes Wi-Fi, recuperação de passwords ou acesso a plataformas. Esta situação consome um tempo valioso da equipa técnica, que poderia ser alocado a tarefas mais complexas. Era necessária uma solução que automatizasse o acesso a estas informações de forma centralizada, disponível em um quiosque físico.</p>\n<h2>✔️ A Solução</h2>\n<p>A solução foi uma aplicação para Windows totalmente orientada a configurações, onde a lógica e a apresentação são separadas de forma clara:</p>\n<ul>\n<li><strong>Arquitetura Baseada em Perfis JSON:</strong> Toda a estrutura da aplicação – desde o número de botões no menu, as suas ações (<code>PDF</code>, <code>LINK</code>, <code>FORMS</code>), os seus estilos visuais, até aos textos e imagens dos guias passo a passo – é lida de um ficheiro <code>JSON</code>. Isto permite criar múltiplos perfis com comportamentos e aparências completamente distintas.</li>\n<li><strong>Janela de Configurações Avançada (Protótipo):</strong> Para permitir a gestão por utilizadores não-técnicos, foi desenhada  <strong>prototipada uma janela de gestão avançada</strong>. A interface utiliza uma <code>TreeView</code> que espelha a estrutura do objeto de configuração, e para cada propriedade, apresenta o seu valor atual e uma descrição. <strong>Embora o conceito esteja funcional e demonstre a viabilidade da edição visual, a implementação não está completa</strong>, com algumas funcionalidades de edição ainda por desenvolver.</li>\n<li><strong>Sistema de Personalização Visual Dinâmico:</strong> A aplicação foi projetada para suportar múltiplos temas visuais, com o objetivo de aplicar todas as configurações em tempo real. Muitos aspetos, como imagens de fundo e a opacidade das janelas, já funcionam dinamicamente. No entanto, devido a limitações de tempo e à complexidade da gestão de estado dos controlos em Windows Forms, existem algumas inconsistências conhecidas: certas configurações visuais (como a aplicação de cores ou fontes em controlos específicos) podem não ser refletidas corretamente após uma alteração.</li>\n<li><strong>Biblioteca Auxiliar (<code>BibliotecaAuxiliarForms</code>):</strong> Para promover a reutilização de código e a separação de responsabilidades, foi desenvolvida uma biblioteca de classes que encapsula funcionalidades transversais.</li>\n<li><strong>Funcionalidades de Usabilidade:</strong> Foram adicionados um <strong>ícone na barra de sistema (TrayIcon)</strong> e botões flutuantes para controlar a aplicação.</li>\n</ul>\n<h2>👤 Meu Papel</h2>\n<p>Como projeto de FCT, fui responsável pelo ciclo de vida completo do desenvolvimento desta aplicação, desde a conceção inicial e planeamento até à implementação, testes e documentação. As minhas principais tarefas incluíram:</p>\n<ul>\n<li>Desenhar a arquitetura de software, com foco na modularidade e na separação entre a lógica e a configuração.</li>\n<li>Implementar todas as funcionalidades principais: o menu dinâmico, o sistema de perfis em JSON, a janela de configurações e a biblioteca auxiliar.</li>\n<li>Colaborar com o meu tutor e colegas para recolher feedback e integrar novas ideias e requisitos ao longo do projeto.</li>\n</ul>\n<h2>⚙️ Principais Desafios</h2>\n<ul>\n<li><strong>Criar a Janela de Configurações:</strong> Mapear uma estrutura de objeto complexa (classes aninhadas, listas, dicionários) para uma <code>TreeView</code> interativa e garantir que a edição de cada propriedade fosse segura e intuitiva foi o maior desafio técnico do projeto.</li>\n<li><strong>Evolução da Arquitetura:</strong> A decisão de migrar o armazenamento de ficheiros <code>.txt</code> simples para uma estrutura <code>JSON</code> completa no início do projeto foi crucial, mas exigiu uma refatoração significativa para garantir a escalabilidade.</li>\n<li><strong>Gestão de Tempo e Prioridades:</strong> Equilibrar o desenvolvimento de novas funcionalidades com a necessidade de refatorar e organizar o código existente foi um desafio constante, ensinando-me a importância do planeamento e da gestão de expectativas.</li>\n</ul>\n<h2>✅ Resultados</h2>\n<ul>\n<li><strong>Solução de Alta Flexibilidade:</strong> A capacidade de alterar toda a aplicação através de um ficheiro de configuração é o maior sucesso do projeto, garantindo a sua longevidade e utilidade para a equipa de TI.</li>\n<li><strong>Crescimento Técnico e Pessoal:</strong> O projeto permitiu-me aprofundar drasticamente os meus conhecimentos em C#, .NET, padrões de design de software e boas práticas de desenvolvimento, ao mesmo tempo que desenvolvi competências de comunicação, responsabilidade e adaptação em ambiente profissional.</li>\n</ul>\n<h2>🔮 Próximos Passos</h2>\n<p>Algumas das possíveis evoluções futuras para o projeto são:</p>\n<ul>\n<li><strong>Finalizar a Janela de Configurações:</strong> Concluir a implementação de todas as funcionalidades de edição na interface de gestão, tornando-a totalmente funcional e robusta para utilizadores não-técnicos.</li>\n<li><strong>Robustecer o Sistema de Personalização Visual:</strong> Garantir que todas as configurações de tema (cores, fontes, etc.) sejam aplicadas de forma consistente e em tempo real em todos os controlos da aplicação, resolvendo as inconsistências conhecidas.</li>\n<li><strong>Suporte a Múltiplos Idiomas:</strong> Integrar um sistema de internacionalização para que os textos da interface e dos conteúdos possam ser traduzidos.</li>\n<li><strong>Formulário de Pedidos:</strong> Adicionar uma funcionalidade para que os utilizadores possam submeter pedidos de suporte diretamente através da aplicação, com envio de e-mail automático para a equipa de TI.</li>\n<li><strong>Instalador:</strong> Criar um pacote de instalação (ex: usando WiX Toolset ou Inno Setup) para facilitar a distribuição e implementação da aplicação nos quiosques.</li>\n<li><strong>Testes Automatizados:</strong> Implementar testes unitários para validar a lógica da biblioteca auxiliar e do sistema de configurações.</li>\n</ul>"
  },
  {
    "repo": "SistemaHospitalar",
    "link": "https://github.com/Tiago-Daniel-Guerreiro/SistemaHospitalar",
    "description": "Simulação de gestão hospitalar em Python com foco em programação orientada a objetos.",
    "title": "Sistema de Gestão Hospitalar",
    "description_html": "<p>Um sistema de gestão hospitalar desenvolvido em Python, focado na aplicação de princípios de Programação Orientada a Objetos (POO). O projeto modela entidades e processos complexos de um hospital, como o registo de pacientes, a gestão de diferentes tipos de funcionários, a alocação de salas e um sistema avançado de gestão de horários e calculo de pagamentos. A interação é feita através de uma interface de linha de comando (CLI).</p>\n<p>Este projeto foi realizado no âmbito da disciplina de Programação e Sistemas de Informação do Curso Técnico De Gestão e Programação De Sistemas Informáticos.</p>\n<h2>🎯 Objetivo Principal</h2>\n<p>O objetivo central foi projetar e implementar um sistema funcional que demonstrasse o domínio e a aplicação prática dos seguintes conceitos de Programação Orientada a Objetos:~</p>\n<ul>\n<li><strong>Classes Abstratas:</strong> Para criar \"contratos\" e modelos base (<code>Pessoa</code>, <code>Sala</code>).</li>\n<li><strong>Herança Simples e Múltipla:</strong> Para criar especializações (<code>Medico</code> herda de <code>Funcionario</code>) e combinar papéis (<code>EnfermeiroChefe</code> herda de <code>Enfermeiro</code> e <code>Administrativo</code>).</li>\n<li><strong>Polimorfismo:</strong> Para permitir que o sistema trate objetos de diferentes classes de forma homogénea (ex: calcular pagamentos ou exibir detalhes de diferentes funcionários com a mesma chamada de método).</li>\n<li><strong>Encapsulamento:</strong> Para proteger os dados internos e garantir a sua integridade através de <em>properties</em> e <em>setters</em> com regras de validação.</li>\n<li><strong>Modularização:</strong> Para organizar o código em módulos com responsabilidades distintas, promovendo a coesão e o baixo acoplamento.</li>\n</ul>\n<h2>❓ O Problema</h2>\n<p>A gestão de um ambiente hospitalar é uma tarefa de alta complexidade que envolve a coordenação de múltiplos elementos: o fluxo de pacientes, a alocação de recursos físicos como salas, a gestão de uma equipa diversificada de profissionais e o cálculo de remunerações que variam conforme o cargo, o turno e o desempenho. A criação de um sistema digital para gerir estas operações exige uma modelação de dados que reflita estas complexidades e interações.</p>\n<h2>✔️ A Solução</h2>\n<p>Foi desenvolvido um sistema modular em Python, executado via linha de comando, que modela as operações hospitalares através de uma arquitetura coesa e dividida em três camadas principais:</p>\n<ul>\n<li><strong><code>Program.py</code> - O Núcleo do Sistema (Modelo):</strong></p>\n<ul>\n<li>\n<p>Contém a representação de todas as entidades: <code>Pessoa</code>, <code>Paciente</code>, <code>Funcionario</code>, <code>Sala</code> e as suas especializações (<code>Medico</code>, <code>Enfermeiro</code>, <code>SalaAtendimento</code>, <code>SalaCirurgia</code>).</li>\n<li>Implementa um sistema de pagamento flexível através do padrão <strong>Strategy</strong>, onde diferentes <code>RegraDePagamento</code> (bónus, pagamento por hora, etc.) podem ser dinamicamente adicionadas a um funcionário.</li>\n<li>Utiliza a classe <code>SistemaHospital</code> como um orquestrador central que gere todos os dados em memória.</li>\n</ul>\n</li>\n<li><strong><code>Horario.py</code> - Gestão Avançada de Tempo:</strong></p>\n<ul>\n<li>\n<p>Um módulo altamente especializado e isolado, responsável por toda a lógica temporal.</li>\n<li>Modela conceitos como <code>HoraMinuto</code>, <code>IntervaloTempo</code> e <code>Pausas</code>, com validações robustas.</li>\n<li>Calcula automaticamente o tempo de trabalho diurno e noturno, mesmo em turnos que atravessam a meia-noite.</li>\n<li>A classe <code>FuncionarioHorario</code> atua como uma fachada, simplificando a interação entre um <code>Funcionario</code> e a complexa lógica de horários.</li>\n</ul>\n</li>\n<li><strong><code>Console.py</code> - A Interface do Utilizador (Controlador/Visão):</strong></p>\n<ul>\n<li>\n<p>Responsável por toda a interação com o utilizador através de menus de texto.</li>\n<li>Traduz as ações do utilizador (ex: \"chamar próximo paciente\") em chamadas aos métodos dos objetos do modelo.</li>\n<li>Mantém a lógica de negócio separada da apresentação, permitindo que a interface possa ser substituída no futuro (ex: por uma interface gráfica ou web) com menor impacto.</li>\n</ul>\n</li>\n</ul>\n<h2>👤 Meu Papel</h2>\n<p>Este projeto foi desenvolvido em colaboração. Embora tenha tido um papel ativo em todas as fases do projeto, as minhas principais responsabilidades centraram-se na arquitetura e na implementação da lógica de negócio. Fui responsável por:</p>\n<ul>\n<li>Arquitetura e Modelo de Dados: Estruturar o modelo de classes de raiz, definindo a hierarquia de herança, as classes abstratas e a aplicação de polimorfismo, que são o pilar de todo o sistema.</li>\n<li>Desenvolvimento de Componentes Core: Implementar os mecanismos mais complexos, como o motor de cálculo de horários (Horario.py) e o sistema de pagamentos flexível com o padrão Strategy.</li>\n<li>Refatoração e Qualidade de Código: Após uma fase inicial, liderei uma refatoração significativa do código para aumentar a modularidade e garantir o baixo acoplamento entre os módulos (Program, Horario, Console), melhorando a manutenibilidade geral da aplicação.</li>\n</ul>\n<h2>⚙️ Principais Desafios</h2>\n<p>Durante o desenvolvimento, os desafios mais significativos foram:</p>\n<ul>\n<li><strong>Gestão da Complexidade Temporal:</strong> Implementar a lógica no <code>Horario.py</code> para calcular corretamente as durações e interseções de tempo, especialmente ao lidar com turnos noturnos e pausas, exigiu uma modelação cuidadosa e abstrações bem definidas.</li>\n<li><strong>Herança Múltipla e Composição:</strong> A criação da classe <code>EnfermeiroChefe</code>, que combina as responsabilidades de <code>Enfermeiro</code> e <code>Administrativo</code>, apresentou um desafio na gestão da inicialização e na combinação de diferentes regras de pagamento, resolvido com uma chamada controlada aos construtores das classes-mãe, e verificação de regras de pagamentos repetidas.</li>\n<li><strong>Acoplamento vs. Prazo:</strong> Equilibrar a ambição de criar um sistema completo com o tempo disponível resultou em algumas decisões que aumentaram o acoplamento entre certos componentes.</li>\n</ul>\n<h2>✅ Resultados</h2>\n<p>O projeto resultou num protótipo de sistema de informação hospitalar funcional e modular, que cumpre todos os objetivos académicos propostos.</p>\n<ul>\n<li><strong>Aplicação Prática de POO:</strong> O sistema é uma demonstração clara e funcional do uso de herança, polimorfismo, encapsulamento e modularização para resolver um problema complexo.</li>\n<li><strong>Sistema Extensível:</strong> A arquitetura, especialmente o sistema de regras de pagamento, foi projetada para ser facilmente extensível sem necessidade de alterar o código existente.</li>\n<li><strong>Código Legível e Organizado:</strong> A separação de responsabilidades em três módulos distintos (<code>Program.py</code>, <code>Horario.py</code>, <code>Console.py</code>) torna o código mais fácil de entender, manter e evoluir.</li>\n</ul>\n<h2>🔮Próximos Passos</h2>\n<p>Embora o projeto tenha cumprido os seus objetivos, existem várias melhorias possíveis para o futuro:</p>\n<ul>\n<li><strong>Persistência de Dados:</strong> Implementar uma forma de guardar e carregar o estado do sistema (ex: usando ficheiros JSON, CSV ou uma base de dados como SQLite) para que os dados não se percam ao fechar a aplicação.</li>\n<li><strong>Interface Gráfica (GUI):</strong> Substituir a interface de linha de comando por uma interface gráfica mais amigável, utilizando bibliotecas como Tkinter, PyQt, ou até mesmo uma versão web com Flask/Django.</li>\n<li><strong>Testes Automatizados:</strong> Desenvolver um conjunto de testes unitários e de integração (com <code>pytest</code> ou <code>unittest</code>) para garantir a estabilidade e a correção do código à medida que evolui.</li>\n<li><strong>Refatoração:</strong> Analisar e refatorar pontos de maior acoplamento para aumentar ainda mais a modularidade e a testabilidade do sistema.</li>\n</ul>"
  },
  {
    "repo": "tiago-daniel-guerreiro.github.io",
    "link": "https://github.com/Tiago-Daniel-Guerreiro/tiago-daniel-guerreiro.github.io",
    "description": "Meu portfólio pessoal, construído com HTML, CSS e JavaScript puros.",
    "title": "Portfólio Pessoal | tiago-daniel-guerreiro.github.io",
    "description_html": "<p>Este repositório contém o código-fonte do meu portfólio pessoal. <strong>Desenvolvido inteiramente por iniciativa própria</strong>, este projeto foi construído do zero para funcionar como o meu principal cartão de visita digital. O foco foi criar um site com <strong>design limpo e moderno</strong>, uma <strong>experiência de utilizador fluida</strong> e, acima de tudo, um <strong>código-fonte legível, organizado e de fácil manutenção</strong>.</p>\n<p>O grande objetivo foi ir além do que um perfil no GitHub pode oferecer, criando um espaço controlado para contar a minha história como desenvolvedor, destacar os projetos mais relevantes e demonstrar competências práticas em design e desenvolvimento front-end.</p>\n\n<h2>🚀 Tecnologias e Metodologias</h2>\n<p>Este projeto foi construído intencionalmente <strong>sem frameworks ou bibliotecas externas</strong> (como React ou Bootstrap) para demonstrar um forte domínio dos fundamentos do desenvolvimento web, para ter um maior controle e liberdade no desenvolvimento.</p>\n<ul>\n<li><strong>HTML:</strong> Utilizado para criar uma estrutura de conteúdo semântica e clara.</li>\n<li><strong>CSS:</strong> Responsável por todo o estilo visual. Foram utilizadas técnicas modernas como <strong>Flexbox</strong> e <strong>Grid</strong> para criar layouts complexos e responsivos, juntamente com animações e transições para uma UI mais dinâmica.</li>\n<li><strong>JavaScript (Vanilla JS):</strong> O motor por trás de toda a interatividade do site. Foi usado para manipular o DOM, criar a lógica da galeria de projetos, implementar animações de scroll e validar o formulário de contacto.</li>\n<li><strong>Git &amp; GitHub Pages:</strong> Utilizados para um controlo de versões rigoroso e para o alojamento gratuito e contínuo do site, com atualizações automáticas a cada <code>push</code> na branch principal.</li>\n</ul>\n<h2>✔️ Principais Funcionalidades</h2>\n<ul>\n<li><strong>Design Totalmente Responsivo:</strong> O layout adapta-se de forma fluida ao tamanho do ecrã, desde grandes monitores de desktop até pequenos ecrãs de telemóvel, garantindo uma experiência consistente.</li>\n<li><strong>Galeria de Projetos Interativa:</strong> Uma secção visual dedicada a apresentar os meus trabalhos, com cartões de projeto, descrições e links diretos para o código-fonte e versões de demonstração.</li>\n<li><strong>Animações Subtis de Scroll:</strong> Efeitos de <code>fade-in</code> e <code>slide</code> são aplicados aos elementos à medida que o utilizador rola a página, o que ajuda a guiar a atenção e torna a experiência de navegação mais envolvente.</li>\n<li><strong>Estrutura de Código Limpa:</strong> O projeto segue uma organização de pastas e ficheiros clara, separando conteúdo (HTML), estilo (CSS) e comportamento (JS), com código comentado e de fácil leitura.</li>\n</ul>\n<h2>⚙️ Principais Desafios do Desenvolvimento</h2>\n<ul>\n<li><strong>Equilibrar Design e Funcionalidade:</strong> O maior desafio foi projetar uma interface que fosse ao mesmo tempo minimalista e visualmente impactante, sem sacrificar a usabilidade ou a clareza da informação, especialmente em ecrãs pequenos.</li>\n<li><strong>Implementar Interatividade com JavaScript Puro:</strong> Construir funcionalidades como a galeria de projetos ou o sistema de animações de scroll sem o auxílio de bibliotecas como jQuery exigiu um planeamento cuidadoso da lógica de manipulação do DOM e da gestão de eventos.</li>\n<li><strong>Garantir a Consistência Cross-Browser:</strong> Testar e ajustar o CSS e o JavaScript para garantir que o site se comportasse de forma consistente nos principais navegadores (Chrome, Firefox, Safari).</li>\n</ul>\n<h2>🔮 Próximos Passos</h2>\n<p>O portfólio é um projeto vivo e em constante evolução. Os planos futuros incluem:</p>\n<ul>\n<li>Adicionar novos projetos à galeria à medida que são concluídos.</li>\n<li>Otimizar ainda mais o desempenho, focando no carregamento de imagens e na minificação de ficheiros CSS/JS.</li>\n<li>Melhorar continuamente a acessibilidade.</li>\n<li>Considerar a adição de uma secção de blog para partilhar conhecimentos técnicos.</li>\n</ul>"
  },
  {
    "repo": "Site-Manga",
    "link": "https://github.com/Tiago-Daniel-Guerreiro/Site-Manga",
    "description": "Meu primeiro projeto web, construído como uma Single Page Application (SPA) estática.",
    "title": "Site-Manga (Primeiro Projeto Web)",
    "description_html": "<p>Este foi o meu primeiro projeto de desenvolvimento web, criado como um exercício prático para dominar os fundamentos de <strong>HTML, CSS e JavaScript</strong>. O principal desafio técnico foi construir uma <strong>Single Page Application (SPA)</strong> a partir do zero, sem o auxílio de qualquer framework.</p>\n<blockquote>\n<p><strong>Aviso:</strong> Todas as imagens de manga incluindo as capas foram intencionalmente removidas para respeitar os direitos autorais. O foco do projeto está no código e na arquitetura.</p>\n</blockquote>\n\n<h2>🚀 Tecnologias Utilizadas</h2>\n<ul>\n<li><strong>HTML:</strong> Para a estrutura semântica do conteúdo.</li>\n<li><strong>CSS:</strong> Para a estilização e o layout responsivo das diferentes secções.</li>\n<li><strong>JavaScript (Vanilla JS):</strong> O coração da aplicação, responsável por toda a lógica da SPA.</li>\n</ul>\n<p>A decisão de não usar frameworks foi intencional, com o objetivo de compreender em profundidade como estas ferramentas funcionam.</p>\n<h2>🎯 Objetivo Principal</h2>\n<p>O projeto nasceu de uma pergunta simples: <strong>\"Como construir uma experiência de navegação fluida, sem recarregar a página a cada clique, usando apenas as tecnologias base da web?\"</strong>. O objetivo era, portanto, aprender a manipular o DOM, gerir eventos e simular a navegação entre páginas de forma eficiente.</p>\n<h2>✔️ A Solução</h2>\n<p>A solução foi criar uma SPA estática onde todo o conteúdo reside num único ficheiro <code>index.html</code>. A \"magia\" acontece no JavaScript:</p>\n<ul>\n<li><strong>Renderização Dinâmica:</strong> Em vez de navegar para novos ficheiros HTML, o JavaScript mostra e esconde <code>divs</code> (secções) de conteúdo com base nas interações do utilizador inserindo o conteudo necessário nas mesmas.</li>\n<li><strong>Roteamento no Cliente:</strong> Foi implementado um sistema de roteamento simples que escuta cliques em links de navegação. Em vez de seguir o <code>href</code>, ele aciona uma função que exibe a secção correspondente.</li>\n<li><strong>Manipulação do Histórico:</strong> Para uma melhor experiência de utilizador e URLs mais limpas, a <code>History API</code> (<code>history.pushState</code>) foi utilizada para atualizar a URL na barra de endereço sem recarregar a página, permitindo também o uso do botão \"voltar\" do navegador.</li>\n</ul>\n<h2>👤 Meu Papel</h2>\n<p>Este projeto foi um esforço colaborativo, e a minha contribuição foi dupla: definir a visão do produto e liderar a sua execução técnica.</p>\n<ul>\n<li><strong>Idealização e Design de Produto:</strong> Tive um papel central na concepção inicial do projeto. Aproveitando o meu conhecimento sobre as expectativas dos utilizadores para este tipo de plataforma, ajudei a definir a visão geral do site e propus várias funcionalidades específicas para garantir uma experiência de navegação autêntica e intuitiva.</li>\n<li><strong>Arquitetura da Single Page Application (SPA):</strong> Tecnicamente, fui o principal responsável por transformar essa visão numa realidade, desenhando e implementando a arquitetura da SPA. Isto incluiu:</p>\n<ul>\n<li>\n<p>Criar do zero a lógica de roteamento em JavaScript para a navegação sem recarregar a página.</li>\n<li>Implementar as funções de manipulação do DOM para a renderização dinâmica do conteúdo.</li>\n<li>Integrar a <code>History API</code> para uma experiência de utilizador fluida e URLs limpas.</li>\n</ul>\n</li>\n</ul>\n<h2>⚙️ Principais Desafios</h2>\n<ul>\n<li><strong>Aprender as 3 Tecnologias em Simultâneo:</strong> O principal desafio foi internalizar os conceitos de estrutura (HTML), apresentação (CSS) e comportamento (JS) e como eles se interligam.</li>\n<li><strong>Construir a Lógica da SPA do Zero:</strong> Desenvolver o roteador e o sistema de renderização de conteúdo em JavaScript puro foi um exercício complexo, mas extremamente gratificante.</li>\n<li><strong>Organização do CSS:</strong> Manter o CSS organizado e evitar conflitos de estilo entre as diferentes \"páginas\" virtuais.</li>\n</ul>\n<h2>✅ Resultados</h2>\n<ul>\n<li><strong>Compreensão Sólida dos Fundamentos:</strong> A conclusão do projeto solidificou a minha base em desenvolvimento web front-end.</li>\n<li><strong>Base para o Futuro:</strong> A experiência adquirida aqui foi o alicerce que me permitiu aprender frameworks modernos com muito mais facilidade, pois já entendia os problemas que eles se propõem a resolver.</li>\n<li><strong>Primeiro Projeto Funcional:</strong> Transformar conhecimento teórico num produto funcional, mesmo que simples, foi a principal conquista.</li>\n</ul>\n<h2>🔮 Próximos Passos</h2>\n<p>Sendo um projeto de aprendizagem já concluído, os próximos passos possíveis seriam:</p>\n<ul>\n<li><strong>Conectar a uma API:</strong> Transformar o site de estático para dinâmico, buscando os dados de manga a partir de uma API externa.</li>\n<li><strong>Melhorar o Design:</strong> Aplicar os conhecimentos de UI/UX adquiridos desde então para modernizar a aparência.</li>\n</ul>"
  },
  {
    "repo": "Site-Agendamentos",
    "link": "https://github.com/Tiago-Daniel-Guerreiro/Site-Agendamentos",
    "description": "Um sistema de agendamentos web funcional desenvolvido em PHP e MySQL.",
    "title": "Site de Agendamentos",
    "description_html": "<p>Um projeto académico para criar um sistema de agendamentos funcional, desenvolvido com foco no <strong>back-end em PHP</strong> e na interação com uma <strong>base de dados MySQL</strong>. A aplicação permite que utilizadores submetam e visualizem agendamentos através de uma interface web simples.</p>\n<blockquote>\n<p><strong>Aviso de Segurança:</strong> Este é um projeto académico que não está a ser atualizado, pelo que podem existir vulnerabilidades. Ao testar a aplicação, <strong>por favor, não utilize senhas reais ou que use noutros serviços</strong>. Por razões de segurança, a área de administração também se encontra desativada na demonstração.</p>\n</blockquote>\n\n<h2>🚀 Tecnologias Utilizadas</h2>\n<ul>\n<li><strong>Back-end:</strong> PHP</li>\n<li><strong>Base de Dados:</strong> MySQL (gerida via phpMyAdmin)</li>\n<li><strong>Front-end:</strong> HTML e CSS</li>\n</ul>\n<p>A escolha destas tecnologias foi orientada por requisitos académicos e pelo objetivo de solidificar os conhecimentos fundamentais no desenvolvimento web do lado do servidor.</p>\n<h2>🎯 Objetivo Principal</h2>\n<p>O objetivo principal foi construir uma aplicação web \"full-stack\" básica, desde a interface até à base de dados. O projeto serviu como um exercício prático para aprender a:</p>\n<ul>\n<li>Processar dados de formulários HTML com PHP.</li>\n<li>Conectar e executar consultas (<code>queries</code>) numa base de dados MySQL.</li>\n<li>Estruturar uma aplicação PHP de forma modular.</li>\n<li>Compreender o ciclo de vida de uma requisição web num ambiente servidor-cliente.</li>\n</ul>\n<h2>❓ O Problema</h2>\n<p>A gestão manual de agendamentos (por telefone, papel ou email) é ineficiente e propensa a erros, como sobreposições de horários ou perda de informação. Este projeto aborda esse problema criando uma solução digital, centralizada e automatizada para a criação e consulta de agendamentos.</p>\n<h2>✔️ A Solução</h2>\n<p>Uma aplicação web simples, mas funcional, composta por três componentes principais:</p>\n<ul>\n<li><strong>Interface do Utilizador (Front-end):</strong> Páginas dinâmicas onde o HTML é gerado diretamente pelos scripts PHP. Estas páginas incluem formulários para submeter dados e áreas para visualizar os agendamentos. O estilo é gerido com CSS básico.</li>\n<li><strong>Lógica de Negócio (Back-end):</strong> Scripts PHP que recebem os dados dos formulários, validam a informação e comunicam com a base de dados para inserir, atualizar ou consultar agendamentos.</li>\n<li><strong>Persistência de Dados (Base de Dados):</strong> Uma base de dados MySQL que armazena toda a informação de forma estruturada e persistente.</li>\n</ul>\n<h2>👤 Meu Papel</h2>\n<p>Este projeto foi desenvolvido em colaboração, com uma forte divisão de especialidades. O meu papel focou-se principalmente no design da arquitetura e na implementação da lógica PHP:</p>\n<ul>\n<li><strong>Arquitetura da Aplicação:</strong> Fui o principal responsável por desenhar a estrutura geral do projeto, definindo como os diferentes scripts PHP iriam interagir.</li>\n<li><strong>Desenvolvimento Back-end:</strong> Implementei a maior parte da lógica de negócio em PHP, incluindo o processamento dos formulários e a criação dos objetos que representam os dados.</li>\n<li><strong>Modelo Inicial da Base de Dados:</strong> Criei o modelo inicial da classe de interação com a base de dados, estabelecendo o \"contrato\" e a estrutura que seria posteriormente desenvolvida.</li>\n</ul>\n<p>Embora tenha participado em várias fases, o meu colega teve um papel central na implementação final e na otimização da interação com a base de dados MySQL, uma área em que ele era mais experiente. Esta colaboração permitiu-nos entregar um projeto funcional e aprender um com o outro.</p>\n<h2>⚙️ Principais Desafios</h2>\n<ul>\n<li><strong>Conexão Segura PHP-MySQL:</strong> Aprender a gerir credenciais e estabelecer uma conexão estável e segura com a base de dados.</li>\n<li><strong>Depuração (Debugging):</strong> O maior desafio foi identificar e corrigir bugs, tanto na lógica PHP como na interação com a base de dados.</li>\n</ul>\n<h2>✅ Resultados</h2>\n<ul>\n<li><strong>Prova de Conceito Funcional:</strong> O sistema é capaz de criar e listar agendamentos, cumprindo o seu objetivo principal.</li>\n<li><strong>Aprendizagem Prática:</strong> O projeto proporcionou uma experiência valiosa e prática no desenvolvimento web do lado do servidor.</li>\n<li><strong>Base para Projetos Futuros:</strong> A compreensão adquirida sobre PHP e MySQL serve como uma base sólida para projetos web mais complexos.</li>\n</ul>\n<h2>🔮 Próximos Passos</h2>\n<p>O projeto tem potencial para evoluir com as seguintes melhorias:</p>\n<ul>\n<li><strong>Melhorar a Interface (UI/UX):</strong> Modernizar o design para uma experiência mais responsiva e agradável.</li>\n<li><strong>Aumentar a Segurança:</strong> Implementar medidas de segurança mais robustas, como a proteção contra injeção de SQL (<code>SQL Injection</code>) e ataques XSS (<code>Cross-Site Scripting</code>).</li>\n</ul>"
  },
  {
    "repo": "SistemaDeGestaoDeBiblioteca",
    "link": "https://github.com/Tiago-Daniel-Guerreiro/SistemaDeGestaoDeBiblioteca",
    "description": "Sistema de gestão de biblioteca em Python. Permite cadastrar livros e alunos, gerir empréstimos e devoluções.",
    "title": "Sistema de Gestão de Biblioteca",
    "description_html": "<p>Um sistema de gestão de biblioteca desenvolvido em Python como parte da disciplina de Programação de Sistemas de Informação. A aplicação permite o cadastro de livros e alunos, a criação de relatórios, o controlo de empréstimos e devoluções. Todos os dados são guardados em ficheiros JSON, garantindo que a informação não se perde entre sessões.</p>\n<h2>🎯 Objetivo Principal</h2>\n<p>O objetivo central foi criar um sistema funcional para a gestão de uma biblioteca escolar, focando-se na aplicação de conceitos de programação modular e na manipulação de dados. As metas principais incluíam:</p>\n<ul>\n<li><strong>Gerir o Catálogo:</strong> Permitir o cadastro, remoção e pesquisa de livros.</li>\n<li><strong>Gerir Utilizadores:</strong> Permitir o cadastro, remoção e pesquisa de alunos.</li>\n<li><strong>Controlar Empréstimos:</strong> Implementar a lógica para emprestar e devolver livros, associando-os corretamente aos alunos.</li>\n<li><strong>Persistência de Dados:</strong> Garantir que todos os dados (livros, alunos e empréstimos) sejam guardados ao fechar a aplicação e carregados ao iniciá-la.</li>\n<li><strong>Geração de Relatórios:</strong> Criar ficheiros de texto (<code>.txt</code>) com informações selecionadas sobre o estado da biblioteca.</li>\n</ul>\n<h2>❓ O Problema</h2>\n<p>A gestão manual de uma biblioteca, mesmo que pequena, é suscetível a erros e ineficiências. É difícil saber rapidamente quais livros estão disponíveis, quem tem um determinado livro emprestado, ou ter uma visão geral do acervo. A falta de um sistema digitalizado torna o controlo de empréstimos e devoluções uma tarefa manual e demorada.</p>\n<h2>✔️ A Solução</h2>\n<p>Foi desenvolvido um sistema de linha de comando (CLI) com uma arquitetura modular clara, onde cada classe tem uma responsabilidade bem definida:</p>\n<ul>\n<li><strong>Modelo de Dados (<code>Livro</code>, <code>Aluno</code>):</strong></p>\n<ul>\n<li>\n<p>Classes simples que representam as entidades fundamentais do sistema.</li>\n<li>O <code>Livro</code> controla o seu próprio estado de disponibilidade (<code>disponivel</code>).</li>\n<li>O <code>Aluno</code> mantém uma lista dos livros que tem em sua posse.</li>\n</ul>\n</li>\n<li><strong>Orquestrador Central (<code>Biblioteca</code>):</strong></p>\n<ul>\n<li>\n<p>Armazena as listas de todos os livros e alunos.</li>\n<li>Centraliza a lógica de negócio, como validar se um livro pode ser emprestado ou se um aluno já está registado.</li>\n</ul>\n</li>\n<li><strong>Persistência de Dados (<code>Biblioteca_JSON</code>):</strong></p>\n<ul>\n<li>\n<p>Uma classe dedicada a salvar e carregar o estado completo da classe <code>Biblioteca</code>.</li>\n<li>Utiliza o formato JSON para serializar todos os objetos (livros, alunos e suas relações) num único ficheiro, garantindo a integridade dos dados entre execuções.</li>\n</ul>\n</li>\n<li><strong>Geração de Relatórios (<code>Relatorio</code>):</strong></p>\n<ul>\n<li>\n<p>Responsável por agregar e formatar os dados da biblioteca num formato de texto legível.</li>\n<li>Permite ao utilizador escolher quais secções (livros, alunos, empréstimos) devem ser incluídas no relatório final.</li>\n</ul>\n</li>\n<li><strong>Interface de Utilizador (<code>Console_Biblioteca</code>):</strong></p>\n<ul>\n<li>\n<p>Implementa um menu interativo no terminal.</li>\n<li>Guia o utilizador através de opções numeradas para aceder a todas as funcionalidades do sistema, como cadastrar, emprestar, devolver e gerar relatórios.</li>\n</ul>\n</li>\n</ul>\n<h2>👤 Meu Papel</h2>\n<p>Este projeto foi desenvolvido em colaboração. Fui o principal responsável por três áreas-chave do sistema:</p>\n<ul>\n<li><strong>Desenho da Arquitetura de Classes:</strong> Estruturei o modelo de dados, definindo como as classes <code>Livro</code>, <code>Aluno</code> e <code>Biblioteca</code> interagem entre si para representar o estado do sistema de forma coesa.</li>\n<li><strong>Implementação da Lógica de Negócio Core:</strong> Desenvolvi o sistema de empréstimos e devoluções, implementando as validações necessárias para garantir a integridade dos dados (ex: impedir que um livro já emprestado seja emprestado novamente).</li>\n<li><strong>Construção da Interface de Utilizador (CLI):</strong> Criei toda a experiência interativa na consola (<code>Console_Biblioteca</code>), que serve como o ponto de entrada para que o utilizador possa aceder a todas as funcionalidades do sistema de forma intuitiva.</li>\n</ul>\n<h2>⚙️ Principais Desafios</h2>\n<ul>\n<li><strong>Adaptação da Interface:</strong> O plano inicial era construir uma interface gráfica (GUI) com Tkinter. No entanto, devido a restrições de tempo, foi necessário tomar a decisão pragmática de mudar para uma interface de linha de comando (CLI), o que exigiu a reestruturação da interação com o utilizador.</li>\n<li><strong>Garantir a Consistência dos Dados:</strong> Implementar as validações necessárias para evitar inconsistências, como impedir o empréstimo de um livro já emprestado ou o registo de um aluno com uma matrícula duplicada.</li>\n<li><strong>Serialização de Objetos:</strong> Estruturar as classes com métodos <code>to_dict()</code> e <code>from_dict()</code> para garantir que pudessem ser corretamente salvas e carregadas a partir do ficheiro JSON.</li>\n</ul>\n<h2>✅ Resultados</h2>\n<ul>\n<li><strong>Sistema Funcional:</strong> Um programa completo que cumpre todos os requisitos definidos, permitindo a gestão eficaz de uma pequena biblioteca.</li>\n<li><strong>Persistência de Dados:</strong> O sistema armazena e recupera com sucesso todo o seu estado, tornando-o uma ferramenta útil e não apenas uma simulação temporária.</li>\n<li><strong>Código Modular:</strong> A separação de responsabilidades em diferentes classes torna o código mais fácil de entender, manter e expandir no futuro.</li>\n</ul>\n<h2>🔮 Próximos Passos</h2>\n<p>O projeto atual serve como uma base sólida para várias melhorias futuras:</p>\n<ul>\n<li><strong>Implementar a Interface Gráfica (GUI):</strong> Retomar a ideia original e desenvolver uma interface visual com Tkinter, PyQt ou outra biblioteca para uma experiência mais amigável.</li>\n<li><strong>Gestão de Datas:</strong> Adicionar datas de empréstimo e de devolução, permitindo calcular multas ou identificar livros atrasados.</li>\n<li><strong>Pesquisa Avançada:</strong> Melhorar as funcionalidades de pesquisa para permitir procurar livros por autor ou alunos por parte do nome.</li>\n<li><strong>Validação de Entrada:</strong> Implementar validações mais robustas para os dados inseridos pelo utilizador (ex: garantir que o código de um livro segue um formato</li>\n</ul>"
  }
]